app/Controllers/admin/guru.php

SELECT *
FROM `guru`
---
    public function index()
    {
        $data['guru'] = $this->guruModel->findAll();

SELECT *
FROM `sekolah`
---
    public function create()
    {
        $data['sekolah'] = (new SekolahModel())->findAll();

SELECT *
FROM `guru`
WHERE `guru`.`id` = '1'
SELECT *
FROM `sekolah`
---
    public function edit($id)
    {
        $data['guru'] = $this->guruModel->find($id);
        $data['sekolah'] = (new SekolahModel())->findAll();