app/Controllers/admin/sekolah.php

    public function index()
    {
        $data['sekolah'] = $this->sekolahModel->findAll();
---
SELECT *
FROM `sekolah`