app/Controllers/admin/siswa.php

    public function index()
    {
        $data['siswa'] = $this->siswaModel->findAll();
---
SELECT *
FROM `siswa`

    public function create()
    {
        $data['sekolah'] = (new SekolahModel())->findAll();
---
SELECT *
FROM `sekolah`

    public function update($id)
    {
        $data = [
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'nis' => $this->request->getPost('nis'),
            'username' => $this->request->getPost('username'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'kelas' => $this->request->getPost('kelas'),
            'alamat' => $this->request->getPost('alamat'),
            'kontak' => $this->request->getPost('kontak'),
            'email' => $this->request->getPost('email'),
            'status_akun' => $this->request->getPost('status_akun'),
            'sekolah_id' => $this->request->getPost('sekolah_id')
        ];

        // Jika password diisi, update juga
        if ($this->request->getPost('password')) {
            $data['password'] = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);
        }

        $this->siswaModel->update($id, $data);
---
UPDATE `siswa` SET `nama_lengkap` = 'asep', `nis` = '2323423423', `username` = 'suhe2', `jenis_kelamin` = 'L', `kelas` = '12', `alamat` = 'Jl', `kontak` = '09897798789', `email` = 'asepsuhendaralidzkar@gmail.com', `status_akun` = 'aktif', `sekolah_id` = '1', `updated_at` = '2025-06-21 13:34:26'
WHERE `siswa`.`id` IN ('1')