app/Controllers/auth.php

    public function loginProcess()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admincbt'
 LIMIT 1